## Plan Result (sandbox-enterprise)




<pre><code>Plan: 1 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * module.cft_non_production_subscriptions[&#34;DTS-Terraform-Dev-Test3&#34;].azurerm_subscription.this
* Update
  * module.enterprise.azurerm_management_group.level_3[&#34;CFT-NonProd&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.cft_non_production_subscriptions["DTS-Terraform-Dev-Test3"].azurerm_subscription.this will be created
  + resource "azurerm_subscription" "this" {
      + alias             = (known after apply)
      + billing_scope_id  = "/providers/Microsoft.Billing/billingAccounts/59232335/enrollmentAccounts/322108"
      + id                = (known after apply)
      + subscription_id   = (known after apply)
      + subscription_name = "DTS-Terraform-Dev-Test3"
      + tenant_id         = (known after apply)
    }

  # module.enterprise.azurerm_management_group.level_3["CFT-NonProd"] will be updated in-place
  ~ resource "azurerm_management_group" "level_3" {
        id                         = "/providers/Microsoft.Management/managementGroups/CFT-NonProd"
        name                       = "CFT-NonProd"
      ~ subscription_ids           = [
          - "269a14dc-30d9-4be4-91c5-69b15a050bd4",
          - "7a13cef1-427b-4e8d-9817-061eea229fdb",
        ] -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":8,"Program":"tfcmt","SHA1":"","Target":"sandbox-enterprise","Vars":{}} -->